ChucVanLe/Thesis_STM32F4_ControlFlight/filestmf407.c/diskio0.c
	interface_speed(INTERFACE_SLOW);
	
	for (n = 10; n; n--) rcvr_spi();	/* 80 dummy clocks */	

	ty = 0;
	if (send_cmd(CMD0, 0) == 1) {			/* Enter Idle state */
		if (send_cmd(CMD8, 0x1AA) == 1) {	/* SDv2? */
			rcvr_spi();				/* Get trailing return value of R7 resp */
			rcvr_spi();
			buf[2] = rcvr_spi();
			buf[3] = rcvr_spi();
			if (buf[2] == 0x01 && buf[3] == 0xAA) {		/* The card can work at vdd range of 2.7-3.6V */
				for (tmr = 8200; tmr; tmr--) {			/* Wait for leaving idle state (ACMD41 with HCS bit) */
					if (send_cmd(ACMD41, 1UL << 30) == 0) break;
				}
				if (tmr && send_cmd(CMD58, 0) == 0) {	/* Check CCS bit in the OCR */
					//buf[0] = rcvr_spi();
/*.....................................................................................................................*/
					while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);
					SPI1->DR = 0xFF;
					/* Wait for SPI2 data reception */
					while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);
					buf[0] = SPI1->DR;
/*.....................................................................................................................*/
					rcvr_spi();
					rcvr_spi();
					rcvr_spi();
					ty = (buf[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;	/* SDv2 */
				}
			}
		} else {							/* SDv1 or MMCv3 */
			if (send_cmd(ACMD41, 0) <= 1) 	{
				ty = CT_SD1; cmd = ACMD41;	/* SDv1 */
			} else {
				ty = CT_MMC; cmd = CMD1;	/* MMCv3 */
			}
			for (tmr = 8200; tmr; tmr--) {			/* Wait for leaving idle state */
				if (send_cmd(cmd, 0) == 0) break;
			}
			if (!tmr || send_cmd(CMD16, 512) != 0)	/* Set R/W block length to 512 */
				ty = 0;
		}
	}
	
	CardType = ty;
	release_spi();
	
	if (ty) interface_speed(INTERFACE_FAST);
	else power_off();
	
	s = ty ? 0 : STA_NOINIT;
	Stat = s;

	return s;
}



/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/

DRESULT disk_read (
	BYTE drv,			/* Physical drive number (0) */
	BYTE *buff,			/* Pointer to the data buffer to store read data */
	DWORD sector,		/* Start sector number (LBA) */
	BYTE count			/* Sector count (1..255) */
)
{
	if (disk_status(drv) & STA_NOINIT) return RES_NOTRDY;
	if (!count) return RES_PARERR;
	if (!(CardType & CT_BLOCK)) sector *=512 ; /* get address of sector */

	if (count == 1) {	/* Single block read */
		if (send_cmd(CMD17, sector) == 0)	{ /* READ_SINGLE_BLOCK */
			if (rcvr_datablock(buff, 512)) {
				count = 0;
			}
		}
	}
	else {				/* Multiple block read */
		if (send_cmd(CMD18, sector) == 0) {	/* READ_MULTIPLE_BLOCK */
			do {
				if (!rcvr_datablock(buff, 512)) {
					break;
				}
				buff += 512;
			} while (--count);
			send_cmd(CMD12, 0);				/* STOP_TRANSMISSION */
			}
	}
	release_spi();
	return count ? RES_ERROR : RES_OK;
}



/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/
#if _FS_READONLY == 0
DRESULT disk_write (
	BYTE  drv,			/* Physical drive number (0) */
	const BYTE  *buff,	/* Pointer to the data to be written */
	DWORD  sector,		/* Start sector number (LBA) */
	BYTE  count			/* Sector count (1..255) */
)
{	
	
	if (disk_status(drv) & STA_NOINIT) return RES_NOTRDY;
	if (!count) return RES_PARERR;
	if (!(CardType & CT_BLOCK)) sector *= 512;	/* Convert LBA to byte address if needed */

	if (count == 1) {	/* Single block write */
		if ((send_cmd(CMD24, sector) == 0) && (xmit_datablock(buff, 0xFE))) /* WRITE_BLOCK */
				count = 0;
	}
	else {				/* Multiple block write */
		if (CardType & CT_SDC) send_cmd(ACMD23, count);
		if (send_cmd(CMD25, sector) == 0) {	/* WRITE_MULTIPLE_BLOCK */
			do {
				if (!xmit_datablock(buff, 0xFC)) break;
				buff += 512;
			} while (--count);
			if (!xmit_datablock(0, 0xFD))	/* STOP_TRAN token */
				count = 1;
		}
	}
	release_spi();
	return count ? RES_ERROR : RES_OK;
}
#endif /* _READONLY == 0 */
/*-----------------------------------------------------------------------*/
/* Miscellaneous Functions                                               */
/*-----------------------------------------------------------------------*/
#if _USE_IOCTL != 0
DRESULT disk_ioctl (
   BYTE drv,      /* Physical drive number (0) */
   BYTE ctrl,      /* Control code */
   void *buff      /* Buffer to send/receive control data */
)
{
   DRESULT res;
   BYTE n, csd[16], *ptr = buff;
   WORD csize;


   if (drv) return RES_PARERR;

   res = RES_ERROR;

   if (ctrl == CTRL_POWER) {
      switch (*ptr) {
      case 0:      /* Sub control code == 0 (POWER_OFF) */
         if (chk_power())
            power_off();      /* Power off */
         res = RES_OK;
         break;
      case 1:      /* Sub control code == 1 (POWER_ON) */
         power();            /* Power on */
         res = RES_OK;
         break;
      case 2:      /* Sub control code == 2 (POWER_GET) */
         *(ptr+1) = (BYTE)chk_power();
         res = RES_OK;
         break;
      default :
         res = RES_PARERR;
      }
   }
   else {
      if (Stat & STA_NOINIT) return RES_NOTRDY;

      switch (ctrl) {
      case CTRL_SYNC :      /* Make sure that no pending write process */
         CS_L();
         if (wait_ready() == 0xFF)
            res = RES_OK;
         break;

      case GET_SECTOR_COUNT :   /* Get number of sectors on the disk (DWORD) */
         if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {
            if ((csd[0] >> 6) == 1) {   /* SDC ver 2.00 */
               csize = csd[9] + ((WORD)csd[8] << 8) + 1;
               *(DWORD*)buff = (DWORD)csize << 10;
            } else {               /* SDC ver 1.XX or MMC*/
               n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
               csize = (csd[8] >> 6) + ((WORD)csd[7] << 2) + ((WORD)(csd[6] & 3) << 10) + 1;
               *(DWORD*)buff = (DWORD)csize << (n - 9);
            }
            res = RES_OK;
         }
         break;

      case GET_SECTOR_SIZE :   /* Get R/W sector size (WORD) */
         *(WORD*)buff = 512;
         res = RES_OK;
         break;

      case GET_BLOCK_SIZE :   /* Get erase block size in unit of sector (DWORD) */
         if (CardType & CT_SD2) {   /* SDC ver 2.00 */
            if (send_cmd(ACMD13, 0) == 0) {   /* Read SD status */
               rcvr_spi();
               if (rcvr_datablock(csd, 16)) {            /* Read partial block */
                  for (n = 64 - 16; n; n--) rcvr_spi();   /* Purge trailing data */
                  *(DWORD*)buff = 16UL << (csd[10] >> 4);
                  res = RES_OK;
               }
            }
         } else {               /* SDC ver 1.XX or MMC */
            if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {   /* Read CSD */
               if (CardType & CT_SD1) {   /* SDC ver 1.XX */
                  *(DWORD*)buff = (((csd[10] & 63) << 1) + ((WORD)(csd[11] & 128) >> 7) + 1) << ((csd[13] >> 6) - 1);
               } else {               /* MMC */
                  *(DWORD*)buff = ((WORD)((csd[10] & 124) >> 2) + 1) * (((csd[11] & 3) << 3) + ((csd[11] & 224) >> 5) + 1);
               }
               res = RES_OK;
            }
         }
         break;

      case MMC_GET_TYPE :      /* Get card type flags (1 byte) */
         *ptr = CardType;
         res = RES_OK;
         break;

