ChucVanLe/Thesis_STM32F4_ControlFlight/filestmf407.c/diskio0.c
      case MMC_GET_CSD :      /* Receive CSD as a data block (16 bytes) */
         if (send_cmd(CMD9, 0) == 0      /* READ_CSD */
            && rcvr_datablock(ptr, 16))
            res = RES_OK;
         break;

      case MMC_GET_CID :      /* Receive CID as a data block (16 bytes) */
         if (send_cmd(CMD10, 0) == 0      /* READ_CID */
            && rcvr_datablock(ptr, 16))
            res = RES_OK;
         break;

      case MMC_GET_OCR :      /* Receive OCR as an R3 resp (4 bytes) */
         if (send_cmd(CMD58, 0) == 0) {   /* READ_OCR */
            for (n = 4; n; n--) *ptr++ = rcvr_spi();
            res = RES_OK;
         }
         break;

      case MMC_GET_SDSTAT :   /* Receive SD status as a data block (64 bytes) */
         if (send_cmd(ACMD13, 0) == 0) {   /* SD_STATUS */
            rcvr_spi();
            if (rcvr_datablock(ptr, 64))
               res = RES_OK;
         }
         break;

      default:
         res = RES_PARERR;
      }

      release_spi();
   }

   return res;
}
#endif /* _USE_IOCTL != 0 */
// DRESULT disk_ioctl (
// 	BYTE drv,		/* Physical drive nmuber (0) */
// 	BYTE ctrl,		/* Control code */
// 	void *buff		/* Buffer to send/receive control data */
// )
// {
// 	DRESULT res;
// 	BYTE n, csd[16];
// 	DWORD cs;


// 	if (disk_status(drv) & STA_NOINIT) return RES_NOTRDY;	/* Check if card is in the socket */

// 	res = RES_ERROR;
// 	switch (ctrl) {
// 		case CTRL_SYNC :		/* Make sure that no pending write process */
// 			if (select()) {
// 				deselect();
// 				res = RES_OK;
// 			}
// 			break;

// 		case GET_SECTOR_COUNT :	/* Get number of sectors on the disk (DWORD) */
// 			if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {
// 				if ((csd[0] >> 6) == 1) {	/* SDC ver 2.00 */
// 					cs = csd[9] + ((WORD)csd[8] << 8) + ((DWORD)(csd[7] & 63) << 8) + 1;
// 					*(DWORD*)buff = cs << 10;
// 				} else {					/* SDC ver 1.XX or MMC */
// 					n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
// 					cs = (csd[8] >> 6) + ((WORD)csd[7] << 2) + ((WORD)(csd[6] & 3) << 10) + 1;
// 					*(DWORD*)buff = cs << (n - 9);
// 				}
// 				res = RES_OK;
// 			}
// 			break;

// 		case GET_BLOCK_SIZE :	/* Get erase block size in unit of sector (DWORD) */
// 			*(DWORD*)buff = 128;
// 			res = RES_OK;
// 			break;

// 		default:
// 			res = RES_PARERR;
// 	}

// 	deselect();

// 	return res;
// }

// #if (STM32_SD_DISK_IOCTRL == 1)
// DRESULT disk_ioctl (
// 	BYTE drv,		/* Physical drive number (0) */
// 	BYTE ctrl,		/* Control code */
// 	void *buff		/* Buffer to send/receive control data */
// )
// {
// 	DRESULT res;
// 	BYTE n, csd[16], *ptr = buff;
// 	WORD csize;

// 	if (drv) return RES_PARERR;

// 	res = RES_ERROR;

// 	if (ctrl == CTRL_SYNC) {
// 		switch (*ptr) {
// 		case 0:		/* Sub control code == 0 (POWER_OFF) */
// 			//if (chk_power())
// 				power_off();		/* Power off */
// 			res = RES_OK;
// 			break;
// 		case 1:		/* Sub control code == 1 (POWER_ON) */
// 			power();				/* Power on */
// 			res = RES_OK;
// 			break;
// 		case 2:		/* Sub control code == 2 (POWER_GET) */
// 			//*(ptr+1) = (BYTE)chk_power();
// 			res = RES_OK;
// 			break;
// 		default :
// 			res = RES_PARERR;
// 		}
// 	}
// 	else {
// 		if (Stat & STA_NOINIT) return RES_NOTRDY;

// 		switch (ctrl) {
// 		case CTRL_SYNC :		/* Make sure that no pending write process */
// 			CS_L();
// 			if (wait_ready() == 0xFF)
// 				res = RES_OK;
// 			break;

// 		case GET_SECTOR_COUNT :	/* Get number of sectors on the disk (DWORD) */
// 			if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {
// 				if ((csd[0] >> 6) == 1) {	/* SDC version 2.00 */
// 					csize = csd[9] + ((WORD)csd[8] << 8) + 1;
// 					*(DWORD*)buff = (DWORD)csize << 10;
// 				} else {					/* SDC version 1.XX or MMC*/
// 					n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
// 					csize = (csd[8] >> 6) + ((WORD)csd[7] << 2) + ((WORD)(csd[6] & 3) << 10) + 1;
// 					*(DWORD*)buff = (DWORD)csize << (n - 9);
// 				}
// 				res = RES_OK;
// 			}
// 			break;

// 		case GET_SECTOR_SIZE :	/* Get R/W sector size (WORD) */
// 			*(WORD*)buff = 512;
// 			res = RES_OK;
// 			break;

// 		case GET_BLOCK_SIZE :	/* Get erase block size in unit of sector (DWORD) */
// 			if (CardType & CT_SD2) {	/* SDC version 2.00 */
// 				if (send_cmd(ACMD13, 0) == 0) {	/* Read SD status */
// 					rcvr_spi();
// 					if (rcvr_datablock(csd, 16)) {				/* Read partial block */
// 						for (n = 64 - 16; n; n--) rcvr_spi();	/* Purge trailing data */
// 						*(DWORD*)buff = 16UL << (csd[10] >> 4);
// 						res = RES_OK;
// 					}
// 				}
// 			} else {					/* SDC version 1.XX or MMC */
// 				if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {	/* Read CSD */
// 					if (CardType & CT_SD1) {	/* SDC version 1.XX */
// 						*(DWORD*)buff = (((csd[10] & 63) << 1) + ((WORD)(csd[11] & 128) >> 7) + 1) << ((csd[13] >> 6) - 1);
// 					} else {					/* MMC */
// 						*(DWORD*)buff = ((WORD)((csd[10] & 124) >> 2) + 1) * (((csd[11] & 3) << 3) + ((csd[11] & 224) >> 5) + 1);
// 					}
// 					res = RES_OK;
// 				}
// 			}
// 			break;

// // 		case MMC_GET_TYPE :		/* Get card type flags (1 byte) */
// // 			*ptr = CardType;
// // 			res = RES_OK;
// // 			break;

// // 		case MMC_GET_CSD :		/* Receive CSD as a data block (16 bytes) */
// // 			if (send_cmd(CMD9, 0) == 0		/* READ_CSD */
// // 				&& rcvr_datablock(ptr, 16))
// // 				res = RES_OK;
// // 			break;

// // 		case MMC_GET_CID :		/* Receive CID as a data block (16 bytes) */
// // 			if (send_cmd(CMD10, 0) == 0		/* READ_CID */
// // 				&& rcvr_datablock(ptr, 16))
// // 				res = RES_OK;
// // 			break;

// // 		case MMC_GET_OCR :		/* Receive OCR as an R3 resp (4 bytes) */
// // 			if (send_cmd(CMD58, 0) == 0) {	/* READ_OCR */
// // 				for (n = 4; n; n--) *ptr++ = rcvr_spi();
// // 				res = RES_OK;
// // 			}
// // 			break;

// // 		case MMC_GET_SDSTAT :	/* Receive SD status as a data block (64 bytes) */
// // 			if (send_cmd(ACMD13, 0) == 0) {	/* SD_STATUS */
// // 				rcvr_spi();
// // 				if (rcvr_datablock(ptr, 64))
// // 					res = RES_OK;
// // 			}
// // 			break;

// 		default:
// 			res = RES_PARERR;
// 		}

// 		release_spi();
// 	}

// 	return res;
// }
// #endif /* _USE_IOCTL != 0 */












